{
  "template": "gallery",
  "title": "bio",
  "display_title": "This is Pete",
  "text": "<p>Grew up on a small family farm in the finger lakes region of western NY. My dad was a mad scientist of an inventor and builder, and my Mom was very active with 4H where we learned everything from cooking to sewing to raising animals to outdoor skills at summer camp.</p><p>I have a BFA from the New York State College of Ceramics, School of Art and Design at Alfred University. My studies focused on video / sonic / electronic art, graphic design, photography, kinetic sculpture / instillation art, and interactive / web / new media design.</p><p>After school I worked as a software engineer and graphic designer for a company called Coombs Media, most of the work was for Kodak. While living in Rochester I became involved in the western NY art and music scene as a video artist. I primarily showed work at local one-night-only events, and performed video projections for live bands / and sonic artists. I have 2 independent DVD releases of my video work. The first was called systems and was mostly experimental video work from Alfred, the second is called ‘Rochester Collaborations’ which loosely documents my work from NY, showing the collaborations with the sonic artists and musicians from that scene.</p><p>I moved to California in fall of 2004. After getting re-settled I started a regular VJ gig at club Future, and became active in the indie / electro dance scene as a VJ, promoter, and later switched to DJing. All while holding down a day job as a creative software engineer. I started out at MRM / McCann doing some work for Microsoft, and then moved to ATTIK where I launched a number of huge crazy flash websites for Scion Lexus.</p><p>I spent 9 years working at Odopod as a senior software engineer, making award winning interactive experiences for Nike, Got Milk, Honda, Google, Nest, Tesla, Sony, Nvidia, Nestea, Dolby, EA, Audemars Piguet, Subzero Wolf, etc. This place was amazing, so many good times and projects with the odopod family.</p>"
}
