{
  "title": "resume",
  "display_title": "Pete Schirmer Resume 2020",
  "template": "text",
  "text": "<h2>Mission</h2><p>I focus on making interactive experiences beyond the desktop. Projects that spark my interest are physical experiences like museum exhibits, point of sale experiences, dedicated UI for hardware, car dashboards, consumer electronics, rapid prototyping, R&amp;D etc. Im very interested in the DIY \"make\" movement, internet of things, rapid prototyping for product development, and ultimately working with other creatives to create delightful and memorable experiences. I love problem solving, working with design to solve tough UX problems, and feel it’s important to continue to learn and grow while I work, as the work itself grows and evolves around us.</p><h2>Qualifications</h2><ul><li><p>Fast learner and skilled problem solver</p></li><li><p>Quick to pick up new languages and adapt with changing technological requirements</p></li><li><p>Ability to explain complicated technologies and concepts to non-technical audiences</p></li><li><p>Strong foundation in design across physical, visual, and user experience</p></li><li><p>Dedication to creative craftsmanship, attention to detail, documentation, and usability</p></li><li><p>Experience as a mentor, teacher, and team leader</p></li></ul><h3>Expert:</h3><p>Javascript, ES6, Node.js, Express, React, Electron, Gulp, CSS, LESS, SCSS, Responsive, Pug, Nunjucks, CMS, Native iOS, Swift, Objective-C, ActionScript, build systems, static site generators, dev tool development, Arduino, Raspberry Pi, Fusion 360, Photoshop, Illustrator, UX Design</p><h3>Experience:</h3><p>C++, C#, JQuery, Redux, SQL, NoSQL, RegEX, Python, PHP, Test Frameworks, Agile, Dev Ops, Docker, CI, Ansible, Git, Lint, REST APIs, ARKit, A-frame, THREE.js, VR, Unity, Open Frameworks, OSX native, Circuit board design, Bluetooth, RFID, 3D-Printing, Laser Cutting, Rhino, Grasshopper, CAM, CNC Milling, Video Editing, UI Design, Logo &amp; Branding, Layout, Sketch, Figma</p><h2>Work Experience</h2><h4>Prototype Engineer - Full-Stack | Creative Technology<br>Twitter Oct 2019 - Current. (Contract)</h4><p>Working with the Twitter Next (Brand Strategy) team across a variety of creative consulting, prototype engineering, proof-of-concept, and internal tool development. Projects and roles include full-stack React apps, API integrations, UI design, UX design, dev ops, multi-app &amp; multi-platform experience prototypes, hardware prototyping, industrial design, physical fabrication, research &amp; development.</p><h4>Senior Engineer - Creative Technology<br>MATTER (acquired by Fjord / Accenture) Jan 2017 - May 2019.</h4><p>Lead technical consultant &amp; prototype engineer for a team of experience and industrial designers. Duties include; research, prototype engineering hardware and software, user testing, UX development, fabrication, consulting, make-shop management, internal education. Projects in the VR, AR, medical technology, robotics, consumer electronics, and point of sale and exhibit design spaces.</p><h4>Senior Engineer II - Front End | Full-Stack | Native<br>Odopod (acquired by Nurun / Publicis) Jan 2008 - Nov 2016.</h4><p>Long-term senior role for interactive design agency, focused on front end development, software architecture, dev tools, point-of-sale interactive experiences, multi-screen systems, internet of things, native iOS development, research &amp; development, mentorship and team building.</p><p>Notable projects include; Tesla retail store kiosk experiences, Audemars Piguet point-of-sale, Sony.com, Nest.com, various award winning creative marketing websites.</p><p>Clients include; HP, Nike, Tesla, Honda, BF Goodrich, Nest, Dolby Labs, Audemars Piguet, EA Games, Coca-cola, Subzero Wolf, Google, Microsoft, and Sony.</p><h4>Senior Engineer - Front End<br>Attik, June 2006 - Aug 2007.</h4><p>Lead engineer / technical team management for advertising and marketing firm. Worked on developing several large promotional sites and marketing campaigns for Scion Lexus, including framework / architecture development and coordinating to onboard and integrate code from external engineering teams across several countries.</p><h2>Education</h2><h4>BFA, May 2001. NYSCC, School of Art and Design at Alfred University.</h4><p>Studies focused on electronic art, graphic and interactive Design.</p><p><a href=\"http://thisispete.com/pete_schirmer_resume_2020.pdf\" title=\"\"><strong>Download PDF</strong></a></p>"
}
