{
  "title": "resume",
  "display_title": "Pete Schirmer Resume 2024",
  "template": "text",
  "text": "<h2>Mission</h2><p>I create delightful interactive experiences. Projects that spark my interest are physical experiences like museum exhibits, point of sale experiences, dedicated UI for hardware, car dashboards, consumer electronics, rapid prototyping, R&amp;D, as well as digital design such as brand, generative design, tool building, and real-time 3D rendering.  Im very interested in the DIY \"make\" movement, internet of things, rapid prototyping for product development, and ultimately working with other creatives to create  memorable experiences. I love problem solving, working with design to solve tough UX problems, and feel it’s important to continue to learn and grow while I work, as the work itself grows and evolves around us.</p><h2>Qualifications</h2><ul><li><p>Over 20 years of experience at the intersection of Design and Engineering.</p></li><li><p>Wide range of expertise across web. native, &amp; hardware,<br>as well as brand, marketing, & product design.</p></li><li><p>Ability to explain complicated tech and concepts to non-technical audiences</p></li><li><p>Broad understanding of programming languages, architectures, and strategies</p></li><li><p>Strong foundation in design across physical, visual, and user experience</p></li><li><p>Dedication to craftsmanship, attention to detail, documentation, and usability</p></li><li><p>Experience as a mentor, teacher, and team leader</p></li></ul><h2>Work Experience</h2><h4>Creative Software Engineer / Technology Lead - Front End | Full-Stack | Design<br>Block Feb 2021 - Current</h4><p>Working with the brand design team I helped create the new block brand, including creating the interactive Block logoweb landing page at block.xyz using GLSL. As technology lead for the in-house creative studio I've helped lead a team ofdesigners and engineers to build out the block.xyz website, developed and overseen a number of in-house design tools,and served as engineering consultant on a number of other web projects for block's business units such as Square andTBD.</p><h4>Prototype Engineer - Full-Stack | Creative Technology<br>Twitter Oct 2019 - Aug 2020</h4><p>Working with the Twitter Next (Brand Strategy) team across a variety of creative consulting, prototypeengineering, proof-of-concept, and internal tool development. Projects and roles include full-stack Reactapps, API integrations, UI design, UX design, dev ops, multi-app &amp; multi-platform experience prototypes,hardware prototyping, industrial design, physical fabrication, research &amp;  development.</p><h4>Senior Engineer - Creative Technology<br>MATTER (acquired by Fjord / Accenture) Jan 2017 - May 2019.</h4><p>Lead technical consultant &amp; prototype engineer for a team of experience and industrial designers. Duties include; research, prototype engineering hardware and software, user testing, UX development, fabrication, consulting, make-shop management, internal education. Projects in the VR, AR, medical technology, robotics, consumer electronics, and point of sale and exhibit design spaces.</p><h4>Senior Engineer II - Front End | Full-Stack | Native<br>Odopod (acquired by Nurun / Publicis) Jan 2008 - Nov 2016.</h4><p>Long-term senior role for interactive design agency, focused on front end development, software architecture, dev tools, point-of-sale interactive experiences, multi-screen systems, internet of things, native iOS development, research &amp; development, mentorship and team building.</p><p>Notable projects include; Tesla retail store kiosk experiences, Audemars Piguet point-of-sale, Sony.com, Nest.com, various award winning creative marketing websites.</p><p>Clients include; HP, Nike, Tesla, Honda, BF Goodrich, Nest, Dolby Labs, Audemars Piguet, EA Games, Coca-cola, Subzero Wolf, Google, Microsoft, and Sony.</p><h4>Senior Engineer - Front End<br>Attik, June 2006 - Aug 2007.</h4><p>Lead engineer / technical team management. Built several large promotional sites for Scion Lexus, including framework &architecture development and coordinating engineering teams across several countries.</p><h2>Education</h2><h4>BFA, May 2001. NYSCC, School of Art and Design at Alfred University.</h4><p>Studies focused on electronic art, graphic and interactive Design.</p><h3>Keywords:</h3><p>Javascript, Svelte, Node.js, WebGL, GLSL, Three.js, Sanity.io, Contentful, React, Electron, Gulp, CSS, LESS, SCSS, Responsive, Pug, Native iOS, Swift, Objective-C, ActionScript, build systems, static site generators, Arduino, Raspberry Pi, Fusion 360, Photoshop, Illustrator, UX Design C++, C#, Next.js, JQuery, SQL, Redis, RegEX, Python, PHP, Dev Ops, Docker, CI, Ansible, Git, Lint, REST APIs, ARKit, A-frame, VR, Blender, Unity, Open Frameworks, OSX native, Circuit board design, Bluetooth, RFID, 3D-Printing, Laser Cutting, Rhino, Grasshopper, CAM, CNC Milling, Video Editing, UI Design, Logo &amp; Branding, Layout, Sketch, Figma, Software design, Generative Design, ChatGPT.ng, Laser Cutting, Rhino, Grasshopper, CAM, CNC Milling, Video Editing, UI Design, Logo &amp; Branding, Layout, Sketch, Figma</p><p><a href=\"/pete_schirmer_resume_2024.pdf\" title=\"resume\"><strong>Download PDF</strong></a></p>",
  "OGImage": "",
  "OGDescription": "Creative Technologist | Prototype UX Engineer"
}