{
  "title": "resume",
  "display_title": "Pete Schirmer Resume 2024",
  "template": "text",
  "text": "<h2>About</h2><p>Design engineer with over 20 years of experience creating award-winning digital and physical products — from websites and in-person digital experiences to consumer electronics and brand identities. I thrive on 0→1 prototypes and solving complex creative challenges. Recognized for leadership, craftsmanship, creative direction, and technical insight.</p><h2>Work Experience</h2><h4>Design Engineer / Tech Lead | Block<br>Feb 2021 – Present</h4><p>Technical lead for the Block brand team, combining hands-on craft with strategic thinking. Partnered with leadership to transform Square into Block: launching block.xyz, co-designing the current Block logo, and evolving creative systems. Beyond brand work, developed internal tools and platforms that streamlined publishing, improved accessibility, and empowered design teams across Block, Square, Cash App, and TBD.</p><ul><li><p>Launched block.xyz with the iconic WebGL-powered twisted cube landing page that defined the brand’s debut</p></li><li><p>Co-designed the current Block logo, refining the brand to align with the company’s evolving vision</p></li><li><p>Shaped web stack and CMS architecture to enable flexible editorial layouts and faster publishing — adopted across multiple Block business units</p></li><li><p>Created internal tools for secure collaboration and self-serve branded asset generation, multiplying team velocity</p></li><li><p>Established new accessibility standards that set precedent for inclusive design across Block’s web properties</p></li><li><p>Pioneered a mobile-first design approach for Cash web, aligning with actual usage patterns</p></li><li><p>Built AI-powered prototypes and tooling to explore applications across design, content, and development workflows</p></li></ul><h4>Design Engineer | Twitter<br>Oct 2019 – Aug 2020</h4><p>Designed and built experimental prototypes that reimagined how people might interact with Twitter. Developed Tweet-to-Pay, a hack-week-winning collaboration with Block’s Cash App, and created physical data-driven devices visualizing real-time social activity. Projects combined hardware, software, and UX, extending Twitter’s platform into novel, real-world experiences.</p><h4>Design Engineer | MATTER (acquired by Fjord / Accenture)<br>Jan 2017 – May 2019</h4><p>Turned early-stage ideas into working prototypes across VR, robotics, AR, and connected devices, bridging industrial design and software engineering. Explored novel UX for delivery and surgical robots, built VR headset interfaces, and developed AR visualizations for product concepts and point-of-sale experiences. Researched emerging technologies, mentored design teams in rapid prototyping, and created tools to help industrial designers test and validate interactions earlier in the design process.</p><h4>Software Engineer / Team Lead | Odopod (acquired by Nurun / Publicis)<br>Jan 2008 – Nov 2016</h4><p>Blended UX, engineering, and motion design to deliver award-winning work for global brands. From Tesla’s multi-screen retail spaces to viral campaigns for Sony and Nvidia, projects spanned websites, mobile, R&amp;D, point-of-sale, and trade-show installations. Mentored engineers and set technical standards, helping the team consistently elevate its craft and deliver memorable user experiences.</p><p><strong>Clients include:</strong> Sony, Nvidia, Nike, Tesla, Honda, Nest, Dolby, Audemars Piguet, EA Games, Coca-Cola, Subzero Wolf, Google, and Microsoft.</p><h4>Software Engineer / Tech Lead | Attik<br>Jun 2006 – Aug 2007</h4><p>Built award-winning experiences for Scion and Lexus, merging front-end development and motion design to craft visually striking, highly interactive websites. As the studio’s first engineer, I helped establish the team’s technical foundation and frameworks, bridging creative and engineering disciplines to deliver ambitious digital work.</p><h2>Education</h2><h4>BFA - NY State College of Ceramics, School of Art & Design, Alfred University<br>1997 – 2001</h4><p>Electronic Art, Graphic Design, Interactive Design, Motion &amp; Video</p><h2>Technical Skills &amp; Expertise</h2><ul><li><strong>Front-End:</strong> Responsive Design, JS/CSS, Svelte, React, WebGL, Three.js, GSAP</li><li><strong>Back-End:</strong> Node.js, PHP, Python, CMS, REST APIs, SQL/NoSQL, Sockets, Auth</li><li><strong>Mobile:</strong> iOS Development (Swift, Objective-C)</li><li><strong>Hardware:</strong> Microcontrollers (Arduino, Raspberry Pi), Wireless (Bluetooth, NFC), IoT</li><li><strong>Industrial Design:</strong> CAD, CAM, CNC, 3D Printing, Laser Cutting</li><li><strong>Graphic Design:</strong> Logo &amp; Branding, Data Vis, Figma, Photoshop, Illustrator</li><li><strong>Multimedia:</strong> Motion Design, Video, 3D, Unity</li><li><strong>Emerging Tech &amp; AI:</strong> AR/VR, Generative AI, RAG, MCP, Agentic Workflows</li><li><strong>Workflow &amp; DevOps:</strong> Docker, CI/CD, Git, Build Systems</li></ul><p><a href=\"/pete_schirmer_resume_2025.pdf\" title=\"Download PDF\"><strong>Download PDF</strong></a></p>",
  "OGImage": "",
  "OGDescription": "Creative Technologist | Prototype UX Engineer"
}